<?php

namespace Database\Seeders;

use Illuminate\Database\Seeder;
use Spatie\Permission\Models\Permission;
class PermissionTableSeeder extends Seeder
{
/**
* Run the database seeds.
*
* @return void
*/
public function run()
{
$permissions = [
'عرض المواد',
'اضافة المواد',
'تعديل المواد',
'حذف المواد',
'عرض مراحل المواد',

'عرض المراحل',
'اضافة المراحل',
'تعديل المراحل',
'حذف المراحل',
'عرض دورات المراحل',

'عرض الدورات',
'اضافة الدورات',
'تعديل الدورات',
'حذف الدورات',
'عرض اقسام الدورات',

'عرض الاقسام',
'اضافة الاقسام',
'تعديل الاقسام',
'حذف الاقسام',
'عرض دروس الاقسام',

'عرض الدروس',
'اضافة الدروس',
'تعديل الدروس',
'حذف الدروس',
'عرض مرفقات الدروس',
'عرض فيديو الدروس',
'عرض اختبارات الدروس',


'عرض المرفقات',
'اضافة المرفقات',
'تعديل المرفقات',
'حذف المرفقات',

'عرض الاختبارات',
'اضافة الاختبارات',
'تعديل الاختبارات',
'حذف الاختبارات',
'عرض اسئلة الاختبارات',
'عرض اجابات الاسئل',

'عرض المساعدين',
'اضافة المساعدين',
'تعديل المساعدين',
'حذف المساعدين',

'عرض الصلاحيات',
'اضافة الصلاحيات',
'تعديل الصلاحيات',
'حذف الصلاحيات',

];
foreach ($permissions as $permission) {
Permission::create(['name' => $permission]);
}
}
}